# Задачи для тренировки циклов

## 1. Сумма чисел

Напишите программу, которая вычисляет сумму чисел от 1 до n, где n вводится пользователем. Используйте цикл `for`. Например:

```
Введите число: 10
Сумма чисел от 1 до 10 равна 55
```

## 2. Вывод квадратов чисел

Напишите программу, которая выводит квадраты чисел от 1 до 10 с помощью цикла `while`. Например:

```
1 4 9 16 25 36 49 64 81 100
```

## 3. Вывод четных чисел

Напишите программу, которая выводит все четные числа от 1 до 20 с помощью цикла `while`. Например:

```
2 4 6 8 10 12 14 16 18 20
```

## 4. Таблица умножения на n

Напишите программу, которая выводит таблицу умножения на n (от 1 до 10) с помощью цикла `for`. Например:

Для n = 5:
```
5 x 1 = 5
5 x 2 = 10
5 x 3 = 15
...
5 x 10 = 50
```

## 5. Обратный отсчет

Напишите программу, которая выводит обратный отсчет от 10 до 1 с помощью цикла `for`. После окончания отсчета выведите сообщение "Старт!". Например:

```
10 9 8 7 6 5 4 3 2 1
Старт!
```

## 6. Вычисление факториала

Напишите программу, которая вычисляет факториал числа, введенного пользователем. Используйте цикл `for` для вычисления факториала. Например:

```
Введите число: 5
Факториал числа 5 равен 120
```

Факториал числа n вычисляется как произведение всех чисел от 1 до n.

## 7. Числа Фибоначчи

Выведите первые 20 чисел Фибоначчи, используя цикл `while`. Числа Фибоначчи - это последовательность, где каждое число является суммой двух предыдущих: 0, 1, 1, 2, 3, 5, 8, 13, 21, ...

## 8. Простые числа

Напишите программу, которая выводит информацию о том, является ли число простым.

Число является простым, если оно делится только на 1 и на само себя.

## 9. Угадай число

Напишите игру "Угадай число". Программа загадывает случайное число от 1 до 100, а пользователь пытается его угадать. После каждой попытки программа сообщает, больше или меньше загаданное число. Игра продолжается, пока пользователь не угадает число. Подсчитайте количество попыток с помощью цикла `while`.

Для генерации случайного числа используйте класс `java.util.Random`.

## 10. Вывод таблицы умножения

Напишите программу, которая выводит таблицу умножения размером 10х10 с помощью вложенных циклов `for`. Например:

```
 1    2    3    4    5    6    7    8    9   10 
 2    4    6    8   10   12   14   16   18   20 
 3    6    9   12   15   18   21   24   27   30 
 4    8   12   16   20   24   28   32   36   40 
 5   10   15   20   25   30   35   40   45   50 
 6   12   18   24   30   36   42   48   54   60 
 7   14   21   28   35   42   49   56   63   70 
 8   16   24   32   40   48   56   64   72   80 
 9   18   27   36   45   54   63   72   81   90 
10   20   30   40   50   60   70   80   90  100 
```

Используйте `System.out.print()` для вывода чисел в одной строке и `System.out.println()` для перехода на новую строку.

## 11. Продвинутые простые числа

Напишите программу, которая выводит все простые числа от 2 до 100. Используйте вложенные циклы: внешний цикл перебирает числа от 2 до 100, а внутренний проверяет, является ли число простым.

Число является простым, если оно делится только на 1 и на само себя.
