# Простые программы на Java

### 1. Сравнение двух чисел

Напишите программу, которая принимает два целых числа и выводит на консоль, какое из них больше.

### 2. Проверка на чётность

Напишите программу, которая принимает целое число и выводит на консоль сообщение о том, является ли оно чётным или нечётным.

### 3. Проверка совершеннолетия

Напишите программу, которая принимает возраст человека и выводит на консоль,  является ли он совершеннолетним (18 лет и старше).

### 4. Проверка делимости

Напишите программу, которая принимает два целых числа и проверяет, делится ли первое число на второе без остатка.

### 5. Определение знака числа

Напишите программу, которая принимает целое число и выводит на консоль, является ли оно положительным, отрицательным или равно нулю.

## Вклад

Если у вас есть идеи по улучшению этих программ или вы хотите добавить новые, пожалуйста, создайте pull request. Я будем рад вашему вкладу!

---

## Техническое задание (ТЗ) на доработку программы "Калькулятор чаевых" с проверкой ввода

### **Цель доработки**

Модифицировать существующее консольное Java-приложение "Калькулятор чаевых" для обеспечения интерактивного ввода данных пользователем с проверкой корректности введенных значений и возможностью завершения программы при некорректном вводе.

### **Функциональные требования**

1. **Ввод данных с проверкой:**
   - Реализовать интерактивный ввод следующих параметров с проверкой корректности:
     - **Сумма счёта (`billAmount`):** 
       - Запрос: "Введите сумму счёта: "
       - Тип данных: `double`
       - Проверка: значение должно быть положительным числом
     - **Процент чаевых (`tipPercentage`):**
       - Запрос: "Введите процент чаевых: "
       - Тип данных: `double`
       - Проверка: значение должно быть неотрицательным числом
     - **Количество участников (`numberOfPeople`):**
       - Запрос: "Введите количество участников: "
       - Тип данных: `int`
       - Проверка: значение должно быть положительным целым числом

2. **Обработка некорректного ввода:**
   - При вводе некорректного значения для любого из параметров, программа должна:
     - Вывести сообщение об ошибке, указывающее на некорректный ввод и завершить своё выполнение.
     
### **Нефункциональные требования**

- Использовать класс `Scanner` для считывания пользовательского ввода
- Для проверки корректности ввода использовать один из следующих подходов:
  - Метод `hasNextDouble()` или `hasNextInt()` класса `Scanner` для проверки типа вводимых данных
- Сохранить существующую логику расчётов и форматированного вывода результатов

### **Пример работы после доработки**

```text
Введите сумму счёта: abc
Ошибка: введено некорректное значение. 
Сумма счёта должна быть положительным числом.
```

```text
Введите сумму счёта: 1000
Введите процент чаевых: -10
Ошибка: введено некорректное значение. Процент чаевых должен быть неотрицательным числом.
```

```text
Введите сумму счёта: 1000
Введите процент чаевых: 10
Введите количество участников: 0
Ошибка: введено некорректное значение. Количество участников должно быть положительным целым числом.
```

```text
Введите сумму счёта: 1000
Введите процент чаевых: 10
Введите количество участников: 4

Сумма счёта: 1000,00
Сколько человек участвовало в обеде: 4
Общий счёт: 1100,00
Процент чаевых: 10.0%
С каждого: 275,00
```

--- 

## Техническое задание (ТЗ): Текстовая анкета

### Описание:
Необходимо разработать программу на языке Java, которая представляет собой текстовую анкету. Программа должна задавать пользователю вопросы и оценивать его ответы, начисляя баллы за правильные ответы. В конце программа должна выводить общий счет пользователя.

Функциональные требования:
1. Программа должна задавать пользователю два вопроса:
   - "Что означает слово 'кошка'? [cat, dog]"
   - "Что означает слово 'собака'? [cat, dog]"

2. Для каждого вопроса программа должна:
   - Выводить вопрос на экран
   - Ожидать ввода ответа от пользователя
   - Проверять правильность ответа
   - Если ответ правильный, начислять 10 баллов и выводить сообщение "Всё верно! 😎"
   - Если ответ неправильный, выводить сообщение "Нужно подумать ещё 🫣"

3. После завершения анкеты программа должна выводить общий счет пользователя.

Технические требования:
1. Программа должна быть написана на языке Java.
2. Для ввода ответов пользователя использовать класс `Scanner`.
3. Для вывода сообщений использовать метод `println()`, `printf()`, `print()`.
4. Для хранения счета использовать переменную типа `int`.
5. Для сравнения ответов пользователя использовать `equals()`, `equalsIgnoreCase()` и другие  методы класса String.

Пример работы программы:
```
Что означает слово 'кошка'? [cat, dog]
CaT
Всё верно! 😎
Что означает слово 'собака'? [cat, dog]
dgo
Нужно подумать ещё 🫣
Счёт: 10
```
